var level_message = {
    //数字图片的宽度
    num_img_w: [63,52,68,90,80,80,80,80,72,68],
    //数字图片的高度
    num_img_h: [100,104,102,100,104,100,106,104,102,102],
    //总关卡数量
    level_total: 20,
    level_01: {
        //关卡名称
        level_name: "level_01",
        //闯关开始前白色方块的位置
        white_arr_start: [3,8,10,11,13,17,21,22,24,25],
        //闯关开始前黑色方块的位置
        black_arr_start: [7,9,12,23,26,27,31],
        //闯关成功时黑色方块的位置
        black_arr_success: [7,8,9,17,25,26,27],
        //黑色方块的数量
        black_num: 7,
    },
    level_02: {
        //关卡名称
        level_name: "level_02",
        //闯关开始前白色方块的位置
        white_arr_start: [3,10,21,27,45],
        //闯关开始前黑色方块的位置
        black_arr_start: [17,22,23,24,25,26,31,38],
        //闯关成功时黑色方块的位置
        black_arr_success: [3,10,21,22,26,27,38,45],
        //黑色方块的数量
        black_num: 8,
    },
    level_03: {
        //关卡名称
        level_name: "level_03",
        //闯关开始前白色方块的位置
        white_arr_start: [8,10,12,15,19,24,29,31,33,37,38,39],
        //闯关开始前黑色方块的位置
        black_arr_start: [1,5,9,11,17,36,40,43,47],
        //闯关成功时黑色方块的位置
        black_arr_success: [9,10,11,15,19,29,31,33,38],
        //黑色方块的数量
        black_num: 9,
    },
    level_04: {
        //关卡名称
        level_name: "level_04",
        //闯关开始前白色方块的位置
        white_arr_start: [0,2,4,6,7,9,11,13,16,18,20,21,23,25,27,28,30,32,34,35,37,39,41,42,44,46],
        //闯关开始前黑色方块的位置
        black_arr_start: [1,3,5,8,10,12,14,15,17,19,22,24,26,29,31,33,36,38,40,43,45,47,48],
        //闯关成功时黑色方块的位置
        black_arr_success: [1,2,3,5,8,10,12,15,17,19,22,24,26,29,31,33,36,38,40,43,45,46,47],
        //黑色方块的数量
        black_num: 23,
    },
    level_05: {
        //关卡名称
        level_name: "level_05",
        //闯关开始前白色方块的位置
        white_arr_start: [7,8,10,12,13,14,16,19,20,21,22,24,25,28,29,32,33,34,35,37,38,40,42,43,44,45,46,48],
        //闯关开始前黑色方块的位置
        black_arr_start: [9,11,15,17,18,23,26,27,30,31,36,39,41,47],
        //闯关成功时黑色方块的位置
        black_arr_success: [8,9,11,12,14,17,20,21,27,29,33,37,39,45],
        //黑色方块的数量
        black_num: 14,
    },
    level_06: {
        //关卡名称
        level_name: "level_06",
        //闯关开始前白色方块的位置
        white_arr_start: [0,1,3,4,5,7,9,12,14,16,17,18,21,22,24,30,31,32,35,38,39,40],
        //闯关开始前黑色方块的位置
        black_arr_start: [2,8,10,11,15,19,23,25,26,28,29,33,36,37],
        //闯关成功时黑色方块的位置
        black_arr_success: [3,8,9,10,11,14,17,18,23,24,29,31,36,39],
        //黑色方块的数量
        black_num: 14,
    },
    level_07: {
        //关卡名称
        level_name: "level_07",
        //闯关开始前白色方块的位置
        white_arr_start: [1,3,4,7,9,12,14,15,16,18,23,24,25,28,31,36,38,39,40,42,43,45,46,47],
        //闯关开始前黑色方块的位置
        black_arr_start: [0,2,5,8,10,11,17,19,21,22,26,29,30,32,33,35,37,44],
        //闯关成功时黑色方块的位置
        black_arr_success: [2,3,8,11,14,16,19,21,23,24,26,28,31,33,36,39,44,45],
        //黑色方块的数量
        black_num: 18,
    },
    level_08: {
        //关卡名称
        level_name: "level_08",
        //闯关开始前白色方块的位置
        white_arr_start: [0,1,4,5,7,8,10,12,13,16,21,22,23,24,26,27,28,29,31,32,34,36,38,39,40,42,44,46,47,48],
        //闯关开始前黑色方块的位置
        black_arr_start: [2,3,6,9,11,14,15,17,18,19,20,25,30,33,35,37,41,43,45],
        //闯关成功时黑色方块的位置
        black_arr_success: [1,2,3,4,5,7,13,14,16,18,20,21,27,29,31,33,37,39,45],
        //黑色方块的数量
        black_num: 19,
    },
    level_09: {
        //关卡名称
        level_name: "level_09",
        //闯关开始前白色方块的位置
        white_arr_start: [0,2,4,5,8,9,10,11,13,15,18,22,23,24,27,28,31,32,33,34,37,43,44,47],
        //闯关开始前黑色方块的位置
        black_arr_start: [1,3,6,7,12,14,16,17,19,20,21,25,26,29,30,35,36,38,39,40,41,42,45,46,48],
        //闯关成功时黑色方块的位置
        black_arr_success: [0,1,2,3,6,10,13,17,20,21,22,23,24,25,26,27,28,31,35,38,42,45,46,47,48],
        //黑色方块的数量
        black_num: 25,
    },
    level_10: {
        //关卡名称
        level_name: "level_10",
        //闯关开始前白色方块的位置
        white_arr_start: [0,2,4,5,6,8,9,11,13,14,15,17,18,20,22,23,24,27,28,29,30,32,33,34,37,38,39,41,43,44,45,47,48],
        //闯关开始前黑色方块的位置
        black_arr_start: [1,3,7,10,12,16,19,21,25,26,31,35,36,40,42,46],
        //闯关成功时黑色方块的位置
        black_arr_success: [10,11,12,16,17,19,23,24,25,26,29,30,31,36,37,42],
        //黑色方块的数量
        black_num: 16,
    },
    level_11: {
        //关卡名称
        level_name: "level_11",
        //闯关开始前白色方块的位置
        white_arr_start: [2,3,8,16,18,22,24,25,29,30,32,33,38],
        //闯关开始前黑色方块的位置
        black_arr_start: [4,9,10,11,12,15,17,19,23,26,31,37,39],
        //闯关成功时黑色方块的位置
        black_arr_success: [9,15,22,23,24,25,29,30,31,33,37,38,39],
        //黑色方块的数量
        black_num: 13,
    },
    level_12: {
        //关卡名称
        level_name: "level_12",
        //闯关开始前白色方块的位置
        white_arr_start: [0,1,3,4,5,6,7,8,10,13,15,19,21,22,24,25,26,27,28,29,30,31,32,33,34,35,36,37,39,41,42,43,45,46,47],
        //闯关开始前黑色方块的位置
        black_arr_start: [2,9,11,12,14,16,17,18,20,23,38,40,44,48],
        //闯关成功时黑色方块的位置
        black_arr_success: [2,5,9,12,16,18,23,24,30,32,37,40,44,48],
        //黑色方块的数量
        black_num: 14,
    },
    level_13: {
        //关卡名称
        level_name: "level_13",
        //闯关开始前白色方块的位置
        white_arr_start: [1,2,4,5,7,9,10,11,14,15,16,17,18,19,20,21,22,23,25,28,29,31,32,33,36,37,38,39,41,44,45,46,47,48],
        //闯关开始前黑色方块的位置
        black_arr_start: [0,3,6,8,12,13,24,26,27,30,34,35,40,42,43],
        //闯关成功时黑色方块的位置
        black_arr_success: [2,10,16,18,22,23,24,25,26,28,31,34,37,38,45],
        //黑色方块的数量
        black_num: 15,
    },
    level_14: {
        //关卡名称
        level_name: "level_14",
        //闯关开始前白色方块的位置
        white_arr_start: [1,4,5,9,14,15,16,17,18,19,21,23,25,26,27,28,29,30,31,32,33,35,37,40,41,43,44,45],
        //闯关开始前黑色方块的位置
        black_arr_start: [0,2,3,6,7,8,10,11,12,13,20,22,24,34,36,38,39,42,46,47,48],
        //闯关成功时黑色方块的位置
        black_arr_success: [2,3,4,8,12,14,20,21,22,23,24,25,26,27,28,34,36,40,44,45,46],
        //黑色方块的数量
        black_num: 21,
    },
    level_15: {
        //关卡名称
        level_name: "level_15",
        //闯关开始前白色方块的位置
        white_arr_start: [4,5,6,7,8,9,11,13,15,17,19,20,22,23,24,25,27,29,30,31,32,33,35,36,37,39,40,42,43,45,47],
        //闯关开始前黑色方块的位置
        black_arr_start: [0,1,2,3,10,12,14,16,18,21,26,28,34,38,41,44,46,48],
        //闯关成功时黑色方块的位置
        black_arr_success: [0,1,2,3,7,10,14,16,18,21,22,24,30,32,34,40,46,48],
        //黑色方块的数量
        black_num: 18,
    },
    level_16: {
        //关卡名称
        level_name: "level_16",
        //闯关开始前白色方块的位置
        white_arr_start: [0,1,3,5,7,9,10,12,13,15,21,22,24,25,29,31,35,36,37,39,42,44,45,46,47],
        //闯关开始前黑色方块的位置
        black_arr_start: [2,4,6,8,11,14,16,17,18,19,20,23,26,27,28,30,32,33,34,38,40,41,43,48],
        //闯关成功时黑色方块的位置
        black_arr_success: [1,2,4,5,7,10,13,14,16,18,20,22,26,28,30,32,34,35,38,41,43,44,46,47],
        //黑色方块的数量
        black_num: 24,
    },
    level_17: {
        //关卡名称
        level_name: "level_17",
        //闯关开始前白色方块的位置
        white_arr_start: [0,1,2,4,6,8,10,12,13,14,16,17,18,19,20,22,27,28,29,30,31,32,33,34,35,38,40,42,44,45,46,47,48],
        //闯关开始前黑色方块的位置
        black_arr_start: [3,5,7,9,11,15,21,23,24,25,26,36,37,39,41,43],
        //闯关成功时黑色方块的位置
        black_arr_success: [3,7,8,9,10,11,12,13,17,23,25,29,33,35,37,41],
        //黑色方块的数量
        black_num: 16,
    },
    level_18: {
        //关卡名称
        level_name: "level_18",
        //闯关开始前白色方块的位置
        white_arr_start: [7,20,26,27,28,29,32,33,37,39,40,42],
        //闯关开始前黑色方块的位置
        black_arr_start: [0,1,2,3,4,5,6,8,9,10,11,12,13,14,15,16,17,18,19,21,22,23,24,25,30,31,34,35,36,38,41,43,44,45,46,47,48],
        //闯关成功时黑色方块的位置
        black_arr_success: [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,22,23,24,25,26,31,35,38,41,42,43,44,45,46,47,48],
        //黑色方块的数量
        black_num: 37,
    },
    level_19: {
        //关卡名称
        level_name: "level_19",
        //闯关开始前白色方块的位置
        white_arr_start: [0,1,5,6,7,10,13,14,16,18,19,21,27,28,29,30,31,32,33,35,38,41,42,43,47],
        //闯关开始前黑色方块的位置
        black_arr_start: [2,3,4,8,9,11,12,15,17,20,22,23,24,25,26,34,36,37,39,40,44,45,46,48],
        //闯关成功时黑色方块的位置
        black_arr_success: [2,8,9,10,11,12,17,18,22,23,24,25,30,32,33,36,37,39,40,44,45,46,47,48],
        //黑色方块的数量
        black_num: 24,
    },
    level_20: {
        //关卡名称
        level_name: "level_20",
        //闯关开始前白色方块的位置
        white_arr_start: [2,4,6,8,11,14,16,17,18,19,20,23,26,27,28,30,32,33,34,38,40,41,43,48],
        //闯关开始前黑色方块的位置
        black_arr_start: [0,1,3,5,7,9,10,12,13,15,21,22,24,25,29,31,35,36,37,39,42,44,45,46,47],
        //闯关成功时黑色方块的位置
        black_arr_success: [0,3,6,8,9,11,12,15,17,19,21,23,24,25,27,29,31,33,36,37,39,40,42,45,48],
        //黑色方块的数量
        black_num: 25,
    },
}

module.exports=level_message;
